//@skip-check module-structure-method-in-regions, module-structure-var-in-region, use-non-recommended-method, module-structure-top-region, module-structure-form-event-regions
 
&НаКлиенте
Перем РедакторМонако;

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПараметрыРедактора = Новый Структура("ИмяРеквизита, ИмяЭлемента", "Редактор", "Редактор");
	
	РедакторМонако = ПолучитьФорму(ПолучитьПолноеИмяФормы("Монако"), ПараметрыРедактора, ЭтотОбъект);
	РедакторМонако.ПриОткрытии(Отказ);

КонецПроцедуры

&НаКлиенте
Процедура РедакторДокументСформирован(Элемент)
	
	РедакторМонако.ConsoleOnReady();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	РедакторМонако.ЗакрытьКонсоль();
	
КонецПроцедуры

#Область ЭтоВсеНеОбязательно

#Область КомандыРедактора

&НаКлиенте
Процедура РедакторПереключитьРежим(Команда)
	
	РедакторМонако.УстановитьРежимЗапроса(Не РедакторМонако.РедакторВРежимеЗапроса());
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторМеню(Команда)
	
	 РедакторМонако.КомандаРедактора("editor.action.quickCommand");
	 
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаменитьВхождения(Команда)
	
	РедакторМонако.КомандаРедактора("editor.action.changeAll");
	
КонецПроцедуры

#КонецОбласти	

&НаКлиенте
Процедура РедакторПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	РедакторМонако.ConsoleOnClick(Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПолноеИмяФормы(НужноеИмяФормы)
	
	ПозицияТочки = СтрНайти(ИмяФормы, ".", НаправлениеПоиска.СКонца);
	Результат = Лев(ИмяФормы, ПозицияТочки) + НужноеИмяФормы;
	Возврат Результат;
	
КонецФункции

#КонецОбласти
